primer_proyecto/app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
---
		public function getUsuarios() {
			return $this->findAll();